[
  {
    "key": "notice",
    "text": "My darling, one thing I notice about you is how you value consistency and effort in the small daily moments and triply value it in the difficult weekly moments. You listen to your emotions, your body, and your soul. You hold on to what matters, not for your sake but for the sake of the relationship, and you ask for clarity instead of letting things drift. It's no hyperbole to state that you are a saint. Even when you are tired or stressed, you do not fake it; you communicate because you want it real, repaired, and steady. Another small thing I've noticed is you also notice people who are quiet at the table and bring them in gently and with their personal comfort in mind. That is a pattern of care I see in you, and it is not loud, but it is constant."
  },
  {
    "key": "moment",
    "text": "Ananya, that Wharncliffe fight-night where you expressed your resilient gratitude was a sign from the heavens that you were divine, so far above petty bullshit, and that you saw love for what it is - the binding force of the universe itself. That night told me you were protecting something about us even when it was hard, and that you were not using the moment to punish me or be selfish. Even when I didn't say it first, you built up the courage to express your love. I did not show up well in that moment, and I didn't learn from it then. But, revisiting it now, it's changing how I see the seriousness and the depth of your commitment to me. I don't need any further proof - you are mind-bogglingly in love with me, in love with yourself, and you want this thing to work out. I'm here. I've stepped up."
  }, 
  {
    "key": "impact",
    "text": "You know how being with you has changed how I carry myself in all my relationships. I no longer assume love is understood or permament; I try to show and nurture it instead. I pay more attention to repair and to the ways my silence or logic can land as distance and insincerity. But, you're not building me up for anoter - this is all for you, I swear. I will fight for us my love. I will not let you slip away, my consistency and effort will spin our love in a magical way to cocoon us. We will come out after months of intense focus on just one another as a new combined being of spiritual metamorphosized intimacy. I hold myself to a higher standard around presence and follow-through, and I can trace that directly to you. Thanks for helping me learn how to respect myself and those I love."
  },
  {
    "key": "commitment",
    "text": "At the end of the day, what matters is now. So, looking ahead, to tonight, tomorrow, and the new year, one thing I am committed to doing is a daily, specific act of connection that is actually within my control: a 20-second touch and one concrete appreciation before we separate and when we reconnect. This matters to me because I want you to feel seen in the way you have asked for, and I want my actions to match what I say I want. I am not promising a different personality, I am committing to many small, steady practices I can keep. I will make the damn coffee and massage your back."
  }
]
