[
  {
    "key": "notice",
    "title": "What I've Noticed About You",
    "detail": "Your motto is consistency in the key small moments. You're tired of my big declarations. You keep track of what is repeated, not what is dramatic. I'm grateful that you call out drift before it becomes distance. You want me to care about these things the way that you do. I've also noticed that you're uniquely observant and caring. You notice who gets overlooked in a room and bring them in quietly, which shows how much you value steadiness, attention, and care.",
    "media": "media/One.png"
  },
  {
    "key": "moment",
    "title": "The Low Moment",
    "detail": "I will not forget the night at Wharncliffe, how you still said you were grateful while we were fighting (again). When you reminded me, it stuck because you chose the ritual even when you were hurt, and you did not use the moment to punish me. That choice, alongside tens of thousands of other similar moments, show you were prioritizing and protecting the relationship under stress, and it made me see how serious and loyal your commitment really is.",
    "media": "media/TwoX.png"
  },
  {
    "key": "impact",
    "title": "Your Impact",
    "detail": "I am better today than earlier today. I now value repair and follow-through more than I used to, and I feel the difference in how I show up. I pay more attention to how my silence or logic can land as distance, and I try to come back sooner instead of letting time \"heal\" (really just erase) it. You helped me see why I need to raise my standard around presence, and that shift is directly tied to being with you.",
    "media": "media/ThreeX.png"
  },
  {
    "key": "commitment",
    "title": "My Commitment",
    "detail": "I commit to competing with myself every day to be the best fucking boyfriend I've ever been. Pun intended. This is within my control, and I think it will enable the steady care you have asked for rather than promises I cannot keep.",
    "media": "media/FourA.png"
  }
]
